//*****************************************************************************
//
// コンソールウィンドウ処理 [Console.h]
//
// Author : LIAO HANCHEN
//
//*****************************************************************************
#ifndef _CONSOLE_H_
#define _CONSOLE_H_

#include "Engine.h"

//*****************************************************************************
//
// クラス宣言
//
//*****************************************************************************
class Console
{
private:
	bool m_ConsoleStatus;

public:
	Console();
	~Console();

	// コンソールの状態を取得
	bool GetConsoleStatue();
};


#endif // !_CONSOLE_H_
