//*****************************************************************************
//
// 島の地面処理 [Island.cpp]
//
//*****************************************************************************
#include "Island.h"

//*****************************************************************************
//
// コンストラクタ
//
//*****************************************************************************
IsLand::IsLand()
{
	m_pos = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	m_rot = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	m_scl = D3DXVECTOR3(1.0f, 1.0f, 1.0f);

	// ポインタ
	m_vertexBuffer = NULL;
	m_indexBuffer = NULL;
}

//*****************************************************************************
//
// デストラクタ
//
//*****************************************************************************
IsLand::~IsLand()
{

}

//*****************************************************************************
//
// 島の地面を初期化する
//
//*****************************************************************************
void IsLand::InitIsland(D3DXVECTOR3 pos, D3DXVECTOR2 planeSize, D3DXVECTOR2 planeNum)
{
	m_pos = pos;	// 位置
	D3DXVECTOR2 maxSize = D3DXVECTOR2(planeSize.x * planeNum.x, planeSize.y * planeNum.y);

	for (int numX = 0; numX < planeNum.x; numX++)
	{
		for (int numY = 0; numY < planeNum.y; numY++)
		{
			MakeVertexDecl(pos);	// 頂点宣言(shader)
		}
	}
}