//*****************************************************************************
//
// ライト処理 [Light.h]
//
// Author : LIAO HANCHEN
//
//*****************************************************************************
#ifndef _LIGHT_H_
#define _LIGHT_H_

#include "Engine.h"

//*****************************************************************************
//
// クラス宣言
//
//*****************************************************************************
class Light
{
private:
	//LightType		m_type;	// 光タイプ

public:
	Light();				// コンストラクタ
	~Light();				// デストラクタ

	void Update();					// 光更新
	void ChangeLight(LightType type);	// チェンジ光

};
#endif // !_LIGHT_H_
